include("node.jl")
include("element.jl")
include("line.jl")
#----------------------------------------------------------------
# ディレクレ境界条件の構造体
#----------------------------------------------------------------
mutable struct Dirichlet
    id::Int64                                 # 境界条件の番号
    value::Float64                            # 境界条件値
    nodes::Vector{Node}                       # 条件を与える節点
end
#----------------------------------------------------------------
# ノイマン境界条件の構造体
#----------------------------------------------------------------
mutable struct Neumman
    id::Int64                                 # 境界条件の番号
    value::Float64                            # 境界条件値
    lines::Vector{Line}                       # 条件を与える線要素
end
#----------------------------------------------------------------
# ソース項の構造体
#----------------------------------------------------------------
mutable struct Source
    id::Int64                                 # 境界条件の番号
    value::Float64                            # 境界条件値
    elements::Vector{Element}                 # 条件を与える要素
end